app/views/movies/show.html.erb

SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
      <p>
        Read all <%= link_to pluralize(@movie.reviews.size, "review"),
                             movie_reviews_path(@movie) %>