app/controllers/movies_controller.rb

  def show
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "movies" SET "description" = ?, "cast" = ?, "director" = ?, "image_file_name" = ?, "updated_at" = ? WHERE "movies"."id" = 7  [["description", "This movie is about a dancer"], ["cast", ""], ["director", ""], ["image_file_name", ""], ["updated_at", Mon, 24 Nov 2014 22:11:34 UTC +00:00]]

  def create
    @movie = Movie.new(movie_params)
    if @movie.save
---
INSERT INTO "movies" ("cast", "created_at", "description", "director", "duration", "image_file_name", "rating", "released_on", "title", "total_gross", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @movie = Movie.find(params[:id])
    if @movie.destroy
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "10"]]
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 10]]