app/controllers/reviews_controller.rb

  def edit
    @review = @movie.reviews.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "5"]]

  def create
    @review = @movie.reviews.new(review_params)
    if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "here's my comment"], ["created_at", Mon, 01 Dec 2014 21:08:44 UTC +00:00], ["movie_id", 1], ["name", "KO Review"], ["stars", 2], ["updated_at", Mon, 01 Dec 2014 21:08:44 UTC +00:00]]

  def update
    @review = @movie.reviews.find(params[:id])
    if @review.update(review_params)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "5"]]
UPDATE "reviews" SET "stars" = ?, "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = 5  [["stars", 5], ["comment", "here's my updated comment"], ["updated_at", Tue, 02 Dec 2014 21:10:28 UTC +00:00]]

  def destroy
    review = @movie.reviews.find(params[:id])
    if review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "6"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 6]]